controllers/SiteController.php

    public function actionIndex()
    {
        $post = Post::find()->all();
---
SELECT * FROM `post`

    public function actionView($id){
        $post = Post::findOne($id);
---
SELECT * FROM `post` WHERE `id`='2'

    public function actionUpdate($id){
         $post = Post::findOne($id);
         if($post->load(yii::$app->request->post()) && $post->save() ){
---
SELECT * FROM `post` WHERE `id`='1'
UPDATE `post` SET `title`='shopify' WHERE `id`=1